{
  "basePoints": 1000,
  "armies": [
    {
      "player": "Cody",
      "playerTitle": "Packlord",
      "armyName": "The Ashen Pact",
      "tagline": "An Uneasy Alliance Against the Iron Tide",
      "backstory": "<h3>Origins of the Pact</h3><p>Long ago, the Blessed Sisters and the Jackals were bitter rivals. The Sisters, devout in their pursuit of purity and divine justice, saw the Jackals as rogues and heretics, while the Jackals viewed the Sisters as zealots blinded by dogma. Their skirmishes were frequent and fierce, leaving scars across the worlds they battled upon.</p><h3>The Rise of the Robot Legion</h3><P>Amidst this turmoil, a dormant force stirred—the ancient and coldly calculating Robot Legion. Awakened from their millennia-long slumber, the Legion emerged with a singular purpose: to reclaim their lost dominion and purge all organic life. Their relentless advance brought devastation, wiping out entire worlds with methodical precision.</p><h3>The First Encounter</h3><p>Both the Blessed Sisters and the Jackals suffered devastating defeats at the hands of the Robot Legion. Realizing their strength alone was insufficient, leaders from both factions, reluctantly at first, agreed to a temporary truce. In their initial combined efforts, they managed to halt the Legion’s advance, though victory remained elusive.</p><h3>The Pact Forged in Ash</h3><p>Faced with the annihilation of their worlds and peoples, the leaders of the Blessed Sisters and the Jackals gathered on the ruins of a once-great city, now reduced to ashes. Here, they forged The Ashen Pact, a sacred and solemn alliance against the greater threat. The Sisters brought their unyielding faith and divine power, while the Jackals contributed their cunning, adaptability, and guerrilla warfare expertise.</p><h3>Shared Purpose</h3><p>The Robot Legion's mechanical nature and reanimation protocols presented a unique challenge. The Sisters’ holy relics and sanctified weaponry were effective against the Legion’s metallic bodies and the dark energies that animated them. Meanwhile, the Jackals’ hit-and-run tactics disrupted the Legion’s formations, targeting key nodes to slow their relentless advance.</p><h3>Ongoing Conflict</h3><p>Despite their combined efforts, tensions persist within The Ashen Pact. The Sisters struggle with the Jackals' morally ambiguous methods, while the Jackals chafe under the Sisters' rigid structure and unwavering faith. Yet, both know that unity is their only hope for survival.</p><h3>Prophecy of the Final Battle</h3><p>Legends speak of a final, apocalyptic confrontation with the Robot Legion, where only the combined might of light and shadow can bring salvation. Until that day, The Ashen Pact fights on, a beacon of hope in a galaxy overshadowed by cold, mechanical tyranny.</p>",
      "summary": "The Ashen Pact is a fragile alliance between the dedicated Blessed Sisters, driven by a divine crusade against the Robot Legion's unholy machines, and the cunning Jackals, who seek to dismantle and repurpose the Legion's technology for their own survival, bound together by the need to combat a common, mechanical foe.",
      "faction": [{ "name": "Jackals" }, { "name": "Blessed Sisters" }],
      "image": "assets/img/ashen-pact-small.jpg",
      "imagePosition": "center 25%",
      "armyURL": "the-ashen-pact",
      "armyForgeID": "vMzljLVC6ZGv",
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },

    {
      "player": "Alex",
      "playerTitle": "General",
      "armyName": "van Louen's Roughnecks",
      "tagline": "The Imperium's Shield Against the Darkness",
      "backstory": "<p>During the defense of Croatoas, then Captain van Louen led the 5th company, 832nd Regiment in the defense of industrial city Krassus' Point against the forces of Chaos. After being denied requested supplies and reinforcements van Louen had his forces organize a retreat from the city to an orbital defense fortress outside the city.</p><p>With the help of the superior defenses of the fortress the 5th company was able to repel repeated attacks from the Chaos forces until the siege of the planet was broken. However Colonel Drast, the commander of the 832nd regiment, viewed the retreat to a defensible position as cowardice and the loss of Krassus' Point as a dereliction of duty by van Louen.</p><p>Drast had van Louen demoted to the rank of lieutenant and van Louen has since been assigned only security patrols and other rear echelon duties. Unknown to van Louen the coming events could be the path to his rising through the ranks and regaining his honor....</p>",
      "summary": "During the defense of Croatoas, Captain van Louen led his company in repelling Chaos forces at Krassus' Point before being forced to retreat to an orbital defense fortress after critical supplies and reinforcements were denied. Branded a coward by Colonel Drast and demoted to lieutenant, van Louen now awaits the opportunity to reclaim his honor and rise through the ranks.",
      "faction": [
        {
          "name": "Human Defense Force",
          "alias": "832nd Mechanized Infantry Regiment"
        }
      ],
      "image": "assets/img/roughnecks-small.jpg",
      "imagePosition": "center 40%",
      "armyURL": "roughnecks",
      "armyForgeID": "Xo19MAwQPGbs",
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },
    {
      "player": "Claire",
      "playerTitle": "Phaeron",
      "armyName": "Korakotep Dynasty of Extermination",
      "tagline": "Immortal Machines, Awakened to Conquer",
      "summary": "A host of Necrons with an unknown Tomb World, led by Overlord Thulakht the Collector, an Overlord with a stymied flayer virus. He hopes to regain memories of his Dynasty by recreating the imagery of war, Collecting and displaying gruesome Trophies from past battles.",
      "faction": [{ "name": "Robot Legions", "alias": "Necrons" }],
      "image": "assets/img/necrons-small.jpg",
      "imagePosition": "center 20%",
      "armyURL": "korakotep",
      "armyForgeID": null,
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },
    {
      "player": "Andrew",
      "playerTitle": "Starseer",
      "armyName": "The Andrewen Sunlinns",
      "tagline": "Celestial Guardians of Balance and Order",
      "summary": "The Saurian Starhost is a primordial race of reptilian warriors guided by ancient celestial wisdom, striving to bring balance and order to the cosmos through calculated warfare.",
      "faction": [{ "name": "Saurian Starhost" }],
      "image": "assets/img/starhost-small.jpg",
      "imagePosition": "center 40%",
      "armyURL": null,
      "armyForgeID": null,
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    }
  ],
  "missions": [
    {
      "number": 1,
      "points": 1000,
      "title": "The Unearthed Tomb",
      "datetime": "2025-02-22T10:00:00-06:00",
      "month": "February",
      "overview": "A mysterious signal emanates from an ancient and forgotten world. It leads to a tomb-like structure, deep beneath a planet's surface, said to be a precursor to the Mechanist Nexus. This ancient site is vital to unlocking the secrets of the Nexus, and now multiple factions have converged to claim it for their own purposes. The battle begins as factions scramble to unearth the tomb's entrance and secure its treasures before they are all lost.",
      "objective": "Each faction races to claim the artifacts inside the tomb, which hold the key to accessing the Mechanist Nexus. The first team to capture and extract the Tomb Artifact from the center of the battlefield wins. The Tomb Artifact is a special objective marker that must be carried to a faction's deployment zone.",
      "victory": "The first player to extract the Tomb Artifact to their deployment zone wins the mission."
    },
    {
      "number": 2,
      "points": 1200,
      "title": "Awakening Threats",
      "datetime": null,
      "month": "March",
      "overview": "The Tomb Artifact has been secured, but the action has caused the ancient mechanisms of the tomb to stir to life, triggering environmental chaos. The Nexus is beginning to wake, and dangerous, volatile terrain has begun to affect the battlefield. The factions are forced to confront one another in a skirmish, as the storm of mechanical and environmental chaos grows stronger.",
      "objective": "The factions must control specific locations that are connected to the Nexus activation. These are Power Nodes that fuel the activation process. Each faction wants to control them to prevent their enemies from accessing them, or to secure their position for future advantage.",
      "victory": null
    },
    {
      "number": 3,
      "points": 1400,
      "datetime": null,
      "month": "April",
      "title": "The Fractured Signal",
      "overview": "A garbled transmission emanates from deep within the Nexus—an intelligence trapped within? Or a warning?",
      "victory": null
    },
    {
      "number": 4,
      "points": 1600,
      "title": "TBD",
      "datetime": null,
      "month": "May",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 5,
      "points": 1800,
      "title": "TBD",
      "datetime": null,
      "month": "June",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 6,
      "points": 2000,
      "title": "TBD",
      "datetime": null,
      "month": "July",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 7,
      "points": 2200,
      "title": "TBD",
      "datetime": null,
      "month": "July",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 8,
      "points": 2400,
      "title": "TBD",
      "datetime": null,
      "month": "August",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 7,
      "points": 2600,
      "title": "TBD",
      "datetime": null,
      "month": "September",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 8,
      "points": 2800,
      "title": "TBD",
      "datetime": null,
      "month": "October",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    },
    {
      "number": 9,
      "points": 3000,
      "title": "TBD",
      "datetime": null,
      "month": "November",
      "overview": "TBD",
      "objective": "TBD",
      "victory": "TBD"
    }
  ]
}
