{
  "basePoints": 1000,
  "armies": [
    {
      "player": "Cody",
      "playerTitle": "Packlord",
      "armyName": "The Ashen Pact",
      "tagline": "An Uneasy Alliance Against the Iron Tide",
      "summary": "The Ashen Pact is a fragile alliance between the dedicated Blessed Sisters, driven by a divine crusade against the Robot Legion's unholy machines, and the cunning Jackals, who seek to dismantle and repurpose the Legion's technology for their own survival, bound together by the need to combat a common, mechanical foe.",
      "faction": ["Jackals", "Blessed Sisters"],
      "image": "assets/img/ashen-pact.jpg",
      "imagePosition": "center 25%",
      "armyURL": "the-ashen-pact",
      "armyForgeID": "vMzljLVC6ZGv",
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },

    {
      "player": "Alex",
      "playerTitle": "General",
      "armyName": "van Louen's Roughnecks",
      "tagline": "The Imperium's Shield Against the Darkness",
      "summary": "During the defense of Croatoas, then Captain van Louen led the 5th company, 832nd Regiment in the defense of industrial city Krassus' Point against the forces of Chaos. After being denied requested supplies and reinforcements van Louen had his forces organize a retreat from the city to an orbital defense fortress outside the city. With the help of the superior defenses of the fortress the 5th company was able to repel repeated attacks from the Chaos forces until the siege of the planet was broken. However Colonel Drast, the commander of the 832nd regiment, viewed the retreat to a defensible position as cowardice and the loss of Krassus' Point as a dereliction of duty by van Louen. Drast had van Louen demoted to the rank of lieutenant and van Louen has since been assigned only security patrols and other rear echelon duties. Unknown to van Louen the coming events could be the path to his rising through the ranks and regaining his honor....",
      "faction": [
        {
          "name": "Human Defense Force",
          "alias": "832nd Mechanized Infantry Regiment"
        }
      ],
      "image": "assets/img/roughnecks.jpg",
      "imagePosition": "center 40%",
      "armyURL": "roughnecks",
      "armyForgeID": "Xo19MAwQPGbs",
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },
    {
      "player": "Claire",
      "playerTitle": "Overlord",
      "armyName": "The Iron Daisy Dynasty",
      "tagline": "Immortal Machines, Awakened to Conquer",
      "summary": "The Necrons are an ancient race of soulless, immortal machines, once proud and living beings, who traded their flesh for cold metal bodies in a dark pact, only to awaken millions of years later to reclaim the galaxy as their rightful dominion.",
      "faction": ["Robot Legions"],
      "image": "assets/img/necrons.jpg",
      "imagePosition": "center 20%",
      "armyURL": null,
      "armyForgeID": null,
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    },
    {
      "player": "Andrew",
      "playerTitle": "Starseer",
      "armyName": "The Andrewen Sunlinns",
      "tagline": "Celestial Guardians of Balance and Order",
      "summary": "The Saurian Starhost is a primordial race of reptilian warriors guided by ancient celestial wisdom, striving to bring balance and order to the cosmos through calculated warfare.",
      "faction": ["Saurian Starhost"],
      "image": "assets/img/starhost.jpg",
      "imagePosition": "center 40%",
      "armyURL": null,
      "armyForgeID": null,
      "wins": 0,
      "losses": 0,
      "objectives": 0,
      "earnedVP": 0,
      "earnedPts": 0
    }
  ],
  "missions": [
    {
      "number": 1,
      "points": 1000,
      "title": "The Unearthed Tomb",
      "datetime": "2025-02-22T10:00:00-06:00",
      "month": "February",
      "overview": "A mysterious signal emanates from an ancient and forgotten world. It leads to a tomb-like structure, deep beneath a planet's surface, said to be a precursor to the Mechanist Nexus. This ancient site is vital to unlocking the secrets of the Nexus, and now multiple factions have converged to claim it for their own purposes. The battle begins as factions scramble to unearth the tomb's entrance and secure its treasures before they are all lost.",
      "objective": "Each faction races to claim the artifacts inside the tomb, which hold the key to accessing the Mechanist Nexus. The first team to capture and extract the Tomb Artifact from the center of the battlefield wins. The Tomb Artifact is a special objective marker that must be carried to a faction's deployment zone.",
      "victory": "The first player to extract the Tomb Artifact to their deployment zone wins the mission."
    },
    {
      "number": 2,
      "points": 1200,
      "title": "Awakening Threats",
      "datetime": null,
      "month": "March",
      "overview": "The Tomb Artifact has been secured, but the action has caused the ancient mechanisms of the tomb to stir to life, triggering environmental chaos. The Nexus is beginning to wake, and dangerous, volatile terrain has begun to affect the battlefield. The factions are forced to confront one another in a skirmish, as the storm of mechanical and environmental chaos grows stronger.",
      "objective": "The factions must control specific locations that are connected to the Nexus activation. These are Power Nodes that fuel the activation process. Each faction wants to control them to prevent their enemies from accessing them, or to secure their position for future advantage.",
      "victory": null
    },
    {
      "number": 3,
      "points": 1400,
      "datetime": null,
      "month": "April",
      "title": "The Fractured Signal",
      "overview": "A garbled transmission emanates from deep within the Nexus—an intelligence trapped within? Or a warning?",
      "victory": null
    }
  ]
}
